Revit 2027 API
Transaction.GetFailureHandlingOptions Method
 Returns the current failure handling options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureHandlingOptions GetFailureHandlingOptions()
Public Function GetFailureHandlingOptions As FailureHandlingOptions
public:
FailureHandlingOptions^ GetFailureHandlingOptions()
member GetFailureHandlingOptions : unit -> FailureHandlingOptions
Return Value
FailureHandlingOptions
 An instance of FailureHandlingOptions
Remarks
 The returned instance is a copy of the options. If changes are made to the options, the new version can be set back to the transaction by calling the SetFailureHandlingOptions(FailureHandlingOptions) method.
See Also
Reference
Transaction Class
Autodesk.Revit.DB Namespace